InformationRegisters/ПЛ_СоответствиеСФронтСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПЛ_СоответствиеСФронтСистемами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПЛ_ТипыОбъектовФронтСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВлияетНаУчетТМЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПЛ_ТипыОбъектовФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФронтСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ТипыФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/MRS_МенеджерОбменаTNG/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗапускЗагрузкиЧековTNGВФоне() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;                                             
	ФронтСистема = Перечисления.ПЛ_ТипыФронтСистем.TNG;
	
	ПараметрыФЗ = Новый Массив();
	ПараметрыФЗ.Добавить(ФронтСистема);
	ПараметрыФЗ.Добавить(ТекущийПользователь);
	Попытка
		ФоновыеЗадания.Выполнить(
		"MRS_МенеджерОбменаTNG.ФоновоеЗаданиеЗагрузкаЧеков",
		ПараметрыФЗ,
		Метаданные.РегламентныеЗадания.MRS_ЗагрузкаЧековTNG.Ключ,
		НСтр("ru = 'Загрузка чеков TNG уже выполняется';
		|en = 'MRS_TNG'"));
	Исключение
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", "Повторный запуск обмена. Загрузка чеков TNG уже выполняется");
	КонецПопытки
	
КонецПроцедуры

Процедура ЗапускПолученияВспомогательныхДанныхTNGВФоне() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
                                             
	ФронтСистема = Перечисления.ПЛ_ТипыФронтСистем.TNG;
	
	ПараметрыФЗ = Новый Массив();
	ПараметрыФЗ.Добавить(ФронтСистема); 
	Попытка
		ФоновыеЗадания.Выполнить(
		"MRS_МенеджерОбменаTNG.ПолучениеВспомогательныхДанныхORACLE",
		ПараметрыФЗ,
		Метаданные.РегламентныеЗадания.MRS_ЗагрузкаВспомогательныхДанныхTNG.Ключ,
		НСтр("ru = 'Загрузка вспомогательных данных TNG уже выполняется';
		|en = 'MRS_TNG'"));
	Исключение
		ЗаписьЖурналаРегистрацииОбмена("Загрузка вспомогательных данных TNG", "Повторный запуск обмена. Загрузка вспомогательных данных TNG уже выполняется");
	КонецПопытки
		
КонецПроцедуры

Процедура ФоновоеЗаданиеЗагрузкаЧеков(ФронтСистема, Пользователь) Экспорт
	
	ДатаЗапрета = ПолучитьДатыЗапрета(ФронтСистема, Пользователь);
	
	Если ТипЗнч(ДатаЗапрета) = Тип("Структура") Тогда 
					
		ВыполнитьЗагрузкуДанныхTNG(ФронтСистема, ДатаЗапрета.НачалоПериода, ДатаЗапрета.КонецПериода,,0);		
		
	Иначе
		
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", "Дата начала выгрузки больше или равна текущему дню.");
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

Функция ВыполнитьПолучениеДанныхTNG(ФронтСистема, НачалоПериода, КонецПериода, ПараметрыКасс = Неопределено, НомерЧека) Экспорт

	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", "Пустые даты выборки!",Истина);

		ВызватьИсключение "Пустые даты выборки!";
		
	КонецЕсли;

	ПараметрыВыборки = ПолучитьПараметрыВыборки(ФронтСистема, НачалоПериода, КонецПериода,НомерЧека);
	
	ЗаполнитьПараметрыЗапроса(НачалоПериода, КонецПериода, ПараметрыКасс, ПараметрыВыборки);
		
	ТаблицаЗначенийORACLE = ПолучениеДанныхORACLE(ПараметрыВыборки);
	
	ДобавитьЧекиКСверке(ТаблицаЗначенийORACLE, ПараметрыВыборки);
	
	Возврат ТаблицаЗначенийORACLE;
	
КонецФункции

Процедура ВыполнитьЗагрузкуДанныхTNG(ФронтСистема, НачалоПериода, КонецПериода, ПараметрыКасс = Неопределено, НомерЧека) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", "Пустые даты выборки!",Истина);

		ВызватьИсключение "Пустые даты выборки!";
		
	КонецЕсли;
	
	Если НачалоДня(НачалоПериода) = НачалоДня(ТекущаяДата()) ИЛИ НачалоДня(КонецПериода) = НачалоДня(ТекущаяДата()) Тогда
		
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", "Загрузка за текущий день или чеки уже загружены!",Истина);
		
		ВызватьИсключение "Не загружать текущий день!";
		
	КонецЕсли;
	
	ПараметрыВыборки = ПолучитьПараметрыВыборки(ФронтСистема, НачалоПериода, КонецПериода, НомерЧека);
	
	ЗаполнитьПараметрыЗапроса(НачалоПериода, КонецПериода, ПараметрыКасс, ПараметрыВыборки);	
	
	ТаблицаЗначенийORACLE = ПолучениеДанныхORACLE(ПараметрыВыборки);
	
	ЗаписатьДанныеДляСопоставления(ТаблицаЗначенийORACLE, ПараметрыВыборки);
	
	ЗаписатьВБазу(ТаблицаЗначенийORACLE, ПараметрыВыборки);
	
	СдвинутьДатуЗапрета(ПараметрыВыборки);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьДатыЗапрета(ФронтСистема, Пользователь)
	
	СтруктураВозврат = Новый Структура;
	
	Текст = "
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(МАКСИМУМ(Даты.ДатаЗапрета), ДЕНЬ) КАК ДатаЗапрета
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета
		|	ИЗ
		|		РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|	ГДЕ
		|		ДатыЗапретаИзменения.Пользователь = &Пользователь
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДатыЗапретаИзменения.ДатаЗапрета
		|	ИЗ
		|		РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|	ГДЕ
		|		ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МАКСИМУМ(питДанныеПродажФронта.Дата)
		|	ИЗ
		|		Документ.питДанныеПродажФронта КАК питДанныеПродажФронта
		|	ГДЕ
		|		питДанныеПродажФронта.ПЛ_ФронтСистема = &ФронтСистема) КАК Даты
		|";

	Запрос = Новый Запрос(Текст);

	// Установка параметров.
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ФронтСистема", ФронтСистема);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		НачалоПериода = Выборка.ДатаЗапрета + 86400;
		КонецПериода = НачалоДня(ТекущаяДата()) - 1;
		
	КонецЦикла;
	
	Если НачалоПериода >= НачалоДня(ТекущаяДата()) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		СтруктураВозврат.Вставить("НачалоПериода",НачалоПериода);
		СтруктураВозврат.Вставить("КонецПериода",КонецПериода);
		
		Возврат СтруктураВозврат;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметрыПодключения(ФронтСистема) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	MRS_НастройкиПодключенияКФронтСистемам.Сервер КАК Сервер,
	               |	MRS_НастройкиПодключенияКФронтСистемам.Порт КАК Порт,
	               |	MRS_НастройкиПодключенияКФронтСистемам.SID КАК SID,
	               |	MRS_НастройкиПодключенияКФронтСистемам.Пользователь КАК Пользователь,
	               |	MRS_НастройкиПодключенияКФронтСистемам.Пароль КАК Пароль,
	               |	MRS_НастройкиПодключенияКФронтСистемам.ДатаЗапретаПодключения КАК ДатаЗапретаПодключения
	               |ИЗ
	               |	РегистрСведений.MRS_НастройкиПодключенияКФронтСистемам КАК MRS_НастройкиПодключенияКФронтСистемам
	               |ГДЕ
	               |	MRS_НастройкиПодключенияКФронтСистемам.ФронтСистема = &ФронтСистема";
	Запрос.УстановитьПараметр("ФронтСистема", ФронтСистема);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметров.Вставить("Сервер",Выборка.Сервер);
		СтруктураПараметров.Вставить("Порт",Выборка.Порт);
		СтруктураПараметров.Вставить("SID",Выборка.SID);
		СтруктураПараметров.Вставить("Пользователь",Выборка.Пользователь);
		СтруктураПараметров.Вставить("Пароль",Выборка.Пароль);
		СтруктураПараметров.Вставить("ДатаЗапретаПодключения",Выборка.ДатаЗапретаПодключения);
		
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(НачалоПериода, КонецПериода, ПараметрыКасс = Неопределено, ПараметрыВыборки) Экспорт

	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда 
		
		ПараметрыВыборки.НачалоВыборки = Формат(НачалоПериода, "ДФ='yyyy-MM-dd HH:mm:ss'");
		ПараметрыВыборки.КонецВыборки =  Формат(КонецДня(КонецПериода), "ДФ='yyyy-MM-dd HH:mm:ss'");
		
	КонецЕсли;
	
	Если ПараметрыКасс <> Неопределено Тогда
		
		СтрокаВыборкиТочекПродаж = ПараметрыВыборки.СтрокаВыборкиТочекПродаж;
		
		ЗапросПараметровКасс = Новый Запрос;
		
		ЗапросПараметровКасс.Текст = "ВЫБРАТЬ
		                             |	ПараметрыКасс.ФронтСистема КАК ФронтСистема,
		                             |	ПараметрыКасс.КодТочкиПродаж КАК КодТочкиПродаж
		                             |ПОМЕСТИТЬ ВТ_Используемые
		                             |ИЗ
		                             |	&ПараметрыКасс КАК ПараметрыКасс
		                             |ГДЕ
		                             |	ПараметрыКасс.Использовать
		                             |;
		                             |
		                             |////////////////////////////////////////////////////////////////////////////////
		                             |ВЫБРАТЬ
		                             |	ВТ_Используемые.ФронтСистема КАК ФронтСистема,
		                             |	ВТ_Используемые.КодТочкиПродаж КАК КодТочкиПродаж
		                             |ИЗ
		                             |	ВТ_Используемые КАК ВТ_Используемые";
		
		ЗапросПараметровКасс.УстановитьПараметр("ПараметрыКасс", ПараметрыКасс);
		
		Выборка = ЗапросПараметровКасс.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаВыборкиТочекПродаж = СтрокаВыборкиТочекПродаж + ?(СтрокаВыборкиТочекПродаж = "", "", ",") + Выборка.КодТочкиПродаж;	
			
		КонецЦикла;
		
		ПараметрыВыборки.СтрокаВыборкиТочекПродаж = СтрокаВыборкиТочекПродаж;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЧекиКСверке(ТаблицаЗначенийORACLE, ПараметрыВыборки) 

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаORACLE.ФронтСистема КАК ФронтСистема,
	               |	ТаблицаORACLE.КассаККМ КАК КассаККМ,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕТОЧКИПРОДАЖ КАК НАИМЕНОВАНИЕТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ КАК НОМЕРТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРЧЕКА КАК НОМЕРЧЕКА,
	               |	ТаблицаORACLE.БизнесДата КАК БизнесДата,
	               |	ТаблицаORACLE.ДатаЗакрытияЧека КАК ДатаЗакрытияЧека,
	               |	ТаблицаORACLE.ДатаОткрытияЧека КАК ДатаОткрытияЧека,
	               |	ТаблицаORACLE.КОДТОВАРА КАК КОДТОВАРА,
	               |	ТаблицаORACLE.НАЗВАНИЕТОВАРА КАК НАЗВАНИЕТОВАРА,
	               |	ТаблицаORACLE.Номенклатура КАК Номенклатура,
	               |	ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА КАК КОЛИЧЕСТВОТОВАРА,
	               |	ТаблицаORACLE.ЦЕНАТОВАРА КАК ЦЕНАТОВАРА,
	               |	ТаблицаORACLE.СУММАТОВАРА КАК СУММАТОВАРА,
	               |	ТаблицаORACLE.ПРИЗНАКНАЛОГА КАК ПРИЗНАКНАЛОГА,
	               |	ТаблицаORACLE.СУММАСКИДКИ КАК СУММАСКИДКИ,
	               |	ТаблицаORACLE.СУММАЧЕКА КАК СУММАЧЕКА,
	               |	ТаблицаORACLE.ИМЯСОТРУДНИКА КАК ИМЯСОТРУДНИКА,
	               |	ТаблицаORACLE.Организация КАК Организация,
	               |	ТаблицаORACLE.Склад КАК Склад,
	               |	ТаблицаORACLE.Подразделение КАК Подразделение
	               |ПОМЕСТИТЬ ТаблицаORACLE
	               |ИЗ
	               |	&ТаблицаORACLE КАК ТаблицаORACLE
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаORACLE.ФронтСистема КАК ФронтСистемаORACLE,
	               |	ТаблицаORACLE.КассаККМ КАК КассаККМORACLE,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕТОЧКИПРОДАЖ КАК НАИМЕНОВАНИЕТОЧКИПРОДАЖORACLE,
	               |	ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ КАК НОМЕРТОЧКИПРОДАЖORACLE,
	               |	ТаблицаORACLE.НОМЕРЧЕКА КАК НОМЕРЧЕКАORACLE,
	               |	ТаблицаORACLE.БизнесДата КАК БизнесДатаORACLE,
	               |	ТаблицаORACLE.ДатаЗакрытияЧека КАК ДатаЗакрытияЧекаORACLE,
	               |	ТаблицаORACLE.ДатаОткрытияЧека КАК ДатаОткрытияЧекаORACLE,
	               |	ТаблицаORACLE.КОДТОВАРА КАК КОДТОВАРАORACLE,
	               |	ТаблицаORACLE.НАЗВАНИЕТОВАРА КАК НАЗВАНИЕТОВАРАORACLE,
	               |	ТаблицаORACLE.Номенклатура КАК НоменклатураORACLE,
	               |	ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА КАК КОЛИЧЕСТВОТОВАРАORACLE,
	               |	ТаблицаORACLE.ЦЕНАТОВАРА КАК ЦЕНАТОВАРАORACLE,
	               |	ТаблицаORACLE.СУММАТОВАРА КАК СУММАТОВАРАORACLE,
	               |	ТаблицаORACLE.ПРИЗНАКНАЛОГА КАК ПРИЗНАКНАЛОГАORACLE,
	               |	ТаблицаORACLE.СУММАСКИДКИ КАК СУММАСКИДКИORACLE,
	               |	ТаблицаORACLE.СУММАЧЕКА КАК СУММАЧЕКАORACLE,
	               |	ТаблицаORACLE.ИМЯСОТРУДНИКА КАК ИМЯСОТРУДНИКАORACLE,
	               |	ТаблицаORACLE.Организация КАК ОрганизацияORACLE,
	               |	ТаблицаORACLE.Склад КАК СкладORACLE,
	               |	ТаблицаORACLE.Подразделение КАК ПодразделениеORACLE,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка, ЗНАЧЕНИЕ(Документ.питДанныеПродажФронта.ПустаяСсылка)) КАК ЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ОрганизацияЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ПодразделениеЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.КассаККМ, ЗНАЧЕНИЕ(Справочник.КассыККМ.ПустаяСсылка)) КАК КассаККМЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.НомерЧека, 0) КАК НомерЧекаЧекОбщепита,
	               |	ВЫБОР
	               |		КОГДА питДанныеПродажФронтаТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ДанныеПродажФронтаВозврат)
	               |			ТОГДА ЕСТЬNULL(-питДанныеПродажФронтаТовары.Ссылка.СуммаДокумента, 0)
	               |		ИНАЧЕ ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.СуммаДокумента, 0)
	               |	КОНЕЦ КАК СуммаДокументаЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.ПЛ_КодТочкиПродажи, """""""") КАК КодТочкиПродажиЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.ПЛ_ФронтСистема, """""""") КАК ФронтСистемаЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Цена, 0) КАК ЦенаЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.Количество, 0) КАК КоличествоЧекОбщепита,
	               |	ВЫБОР
	               |		КОГДА питДанныеПродажФронтаТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ДанныеПродажФронтаВозврат)
	               |			ТОГДА ЕСТЬNULL(-питДанныеПродажФронтаТовары.Сумма, 0)
	               |		ИНАЧЕ ЕСТЬNULL(питДанныеПродажФронтаТовары.Сумма, 0)
	               |	КОНЕЦ КАК СуммаЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.СуммаНДС, 0) КАК СуммаНДСЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.ПЛ_КодКнопки, """""""") КАК КодКнопкиЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.ПЛ_НаименованиеКнопки, """""""") КАК НаименованиеКнопкиЧекОбщепита,
	               |	ЕСТЬNULL(питДанныеПродажФронтаТовары.СуммаСкидки, 0) КАК СуммаСкидкиЧекОбщепита,
	               |	питДанныеПродажФронтаТовары.Ссылка.ВидОперации КАК ВидОперации
	               |ИЗ
	               |	ТаблицаORACLE КАК ТаблицаORACLE
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питДанныеПродажФронта.Товары КАК питДанныеПродажФронтаТовары
	               |		ПО ТаблицаORACLE.ФронтСистема = питДанныеПродажФронтаТовары.Ссылка.ПЛ_ФронтСистема
	               |			И (ПОДСТРОКА(ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ, 1, 10) = ПОДСТРОКА(питДанныеПродажФронтаТовары.Ссылка.ПЛ_КодТочкиПродажи, 1, 10))
	               |			И ТаблицаORACLE.ДатаЗакрытияЧека = питДанныеПродажФронтаТовары.Ссылка.Дата
	               |			И ТаблицаORACLE.НОМЕРЧЕКА = питДанныеПродажФронтаТовары.Ссылка.НомерЧека
	               |			И (ПОДСТРОКА(ТаблицаORACLE.КОДТОВАРА, 1, 50) = ПОДСТРОКА(ЕСТЬNULL(питДанныеПродажФронтаТовары.ПЛ_КодКнопки, """"""""), 1, 50))";
	
	Запрос.УстановитьПараметр("ФронтСистема", ПараметрыВыборки.ФронтСистема);
	Запрос.УстановитьПараметр("ТаблицаORACLE", ТаблицаЗначенийORACLE);
	Запрос.УстановитьПараметр("НачалоПериода",ПараметрыВыборки.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",ПараметрыВыборки.КонецПериода);
	
	ТаблицаЗначенийORACLE = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

Процедура ДобавитьКодСопоставления(КодыСопоставления, ИмяПоляКод, ТипОбъекта, ИмяПоляНаименование = "") Экспорт
	
	НовСтр = КодыСопоставления.Добавить();
	НовСтр.ИмяПоляКод = ИмяПоляКод;
	НовСтр.ТипОбъекта = ТипОбъекта;
	НовСтр.ИмяПоляНаименование = ИмяПоляНаименование;
	
КонецПроцедуры

Функция ПолучитьПараметрыВыборки(ФронтСистема, НачалоПериода = Неопределено, КонецПериода = Неопределено, НомерЧека) 

	СтруктураПараметровВыборки = Новый Структура;
	СтруктураПараметровВыборки.Вставить("СтрокаВыборкиТочекПродаж","");
	СтруктураПараметровВыборки.Вставить("НачалоВыборки",Неопределено);
	СтруктураПараметровВыборки.Вставить("КонецВыборки",Неопределено);
	СтруктураПараметровВыборки.Вставить("НачалоПериода",Неопределено);
	СтруктураПараметровВыборки.Вставить("КонецПериода",Неопределено);
	СтруктураПараметровВыборки.Вставить("ФронтСистема",ФронтСистема);
	СтруктураПараметровВыборки.Вставить("НомерЧека",НомерЧека);
	
	Возврат СтруктураПараметровВыборки;	
	
КонецФункции

Функция ПолучитьСоответсвиеРеквизитыЧека()
	
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("Организация","Организация");
	СоответствиеПолей.Вставить("Подразделение","Подразделение");
	СоответствиеПолей.Вставить("Склад","Склад");
	СоответствиеПолей.Вставить("Дата","ДатаЗакрытияЧека");
	СоответствиеПолей.Вставить("ДатаСмены","БизнесДата");
	СоответствиеПолей.Вставить("ДатаЧека","БизнесДата");
	СоответствиеПолей.Вставить("ПЛ_ДатаОткрытияЧека","ДатаОткрытияЧека");
	СоответствиеПолей.Вставить("КассаККМ","КассаККМ");
	СоответствиеПолей.Вставить("НомерЧека","НОМЕРЧЕКА");
	СоответствиеПолей.Вставить("ПЛ_ФронтСистема","ФронтСистема");
	СоответствиеПолей.Вставить("ПЛ_КодТочкиПродажи","НОМЕРТОЧКИПРОДАЖ");
	СоответствиеПолей.Вставить("КассовыйУзел","КассовыйУзел");
	СоответствиеПолей.Вставить("ПЛ_КодСотрудника","ИМЯСОТРУДНИКА");
	
	Возврат СоответствиеПолей;
	
КонецФункции

Функция ПолучитьСоответсвиеРеквизитыТоварыЧека()

	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("Номенклатура","Номенклатура");
	СоответствиеПолей.Вставить("Цена","ЦЕНАТОВАРА");
	СоответствиеПолей.Вставить("Количество","КОЛИЧЕСТВОТОВАРА");
	СоответствиеПолей.Вставить("Сумма","СУММАТОВАРА");
	СоответствиеПолей.Вставить("СуммаНДС","ПРИЗНАКНАЛОГА");
	СоответствиеПолей.Вставить("ПЛ_КодКнопки","КОДТОВАРА");
	СоответствиеПолей.Вставить("ПЛ_НаименованиеКнопки","НАЗВАНИЕТОВАРА");
	СоответствиеПолей.Вставить("СуммаСкидки","СУММАСКИДКИ");
	//СоответствиеПолей.Вставить("ИдентификаторСтроки","ИДСТРОКИ");
		
	Возврат СоответствиеПолей;
	
КонецФункции

Функция ВидОплатыНаличными()
	
	ПолеВидОплатыНаличными = Справочники.питВидыОплатОрганизаций.ПустаяСсылка();
	
	Если ПолеВидОплатыНаличными = Справочники.питВидыОплатОрганизаций.ПустаяСсылка() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыОплат.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.питВидыОплатОрганизаций КАК ВидыОплат
		|ГДЕ
		|	ВидыОплат.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.питТипыОплат.Наличные)
		|	И ВидыОплат.питВидОперации = ЗНАЧЕНИЕ(Перечисление.питВидыОперацийПоЗагрузкеДанныхПродаж.Реализация)
		|	И НЕ ВидыОплат.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ПолеВидОплатыНаличными = Выборка.Ссылка;
		Иначе
			ПолеВидОплатыНаличными = Справочники.питВидыОплатОрганизаций.ПустаяСсылка();
			
			СтрокаСообщенияОбОшибке = НСтр("ru = 'Не удалось найти вид оплаты со способом оплаты %1 и видом операции %2.'");
			СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
							Перечисления.питТипыОплат.Наличные,
							Перечисления.питВидыОперацийПоЗагрузкеДанныхПродаж.Реализация);
					
			ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", СтрокаСообщенияОбОшибке, Истина);

		КонецЕсли;
	КонецЕсли;
	
	Возврат ПолеВидОплатыНаличными;
	
КонецФункции

Функция ЗапросПоискаЧека(КлючевыеПоляСтрокой) Экспорт
	
	Схема = Новый СхемаЗапроса;
	// Берём первый подходящий чек из загруженных. Загруженный чек обязательно есть в РС ПЛ_СтатусыОбработкиЧековОбщепита
	Схема.УстановитьТекстЗапроса(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Чеки.Ссылка КАК Чек,
	|	ВЫБОР
	|		КОГДА Чеки.Проведен
	|			ТОГДА 0
	|		КОГДА НЕ Чеки.ПометкаУдаления
	|			ТОГДА 10
	|		ИНАЧЕ 20
	|	КОНЕЦ КАК Порядок,
	|	Чеки.Дата КАК Дата
	|ИЗ
	|	Документ.питДанныеПродажФронта КАК Чеки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СтатусыОбработкиЧековОбщепита КАК СтатусыОбработки
	|		ПО Чеки.Ссылка = СтатусыОбработки.ДокументЧек
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Дата");
	
	Отбор = СхемыЗапросов.ЗапросПакетаЗапросов(Схема).Операторы[0].Отбор;
	
	КлючевыеПоляСтрокой = СтрЗаменить(КлючевыеПоляСтрокой, " ", "");
	КлючевыеПоля = СтрРазделить(КлючевыеПоляСтрокой, ",");
	
	Для каждого Поле Из КлючевыеПоля Цикл
		Если Поле = "Дата" Тогда
			Отбор.Добавить("Чеки.Дата = &ДатаЗакрытияЧека");
		Иначе
			Отбор.Добавить("Чеки." + Поле + " = &" + Поле);
		КонецЕсли;	
	КонецЦикла; 
	
	Возврат Новый Запрос(Схема.ПолучитьТекстЗапроса());
	
КонецФункции

Процедура ЗаписатьЧекВИБ(ДокументЧек) Экспорт
	
	ДокументЧек.РасчетСуммДокумента();

	//СтрокаОплаты = ДокументЧек.Оплаты.Добавить();
	//СтрокаОплаты.СуммаОплаты = ДокументЧек.СуммаДокумента;    
	//
	//СтрокаОплаты.ВидОплаты = ?(ЗначениеЗаполнено(МетодОплаты), МетодОплаты, ВидОплатыНаличными());
	//
	//Если НЕ ЗначениеЗаполнено(СтрокаОплаты.ВидОплаты) Тогда 
	//	//Отказ = Истина;
	//	Возврат;
	//КонецЕсли;	
	
	//<< Портал-Юг, Баринов, 2019.04.04 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
	// Для группировки чеков по дням при загрузке в выпуски блюд обработкой "Загрузка из чеков Общепита" номер смены заполним по дате чека.
	// Дата 01.02.2019 будет соответствовать номеру смены 190201
	ДокументЧек.НомерСмены = Формат(ДокументЧек.Дата, "ДФ=yyMMdd");
	//>> Портал-Юг, Баринов, 2019.04.04
	
	Если НЕ ЗаписатьОбъектВИБ(ДокументЧек) Тогда
		//Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьОбъектВИБ(Объект)
	
	ОбъектЗаписан = Истина;
	
	// Для корректной загрузки чеков из обработки ПЛ_ЗагрузкаДанныхИзФронтСистем
	// Передадим это доп свойство в обработчики записи документа и проверим там его наличие. Если Истина, то выполним код ПриЗаписи
	
	Объект.ДополнительныеСвойства.Вставить("ПЛ_ЭтоЗагрузкаДанныхИзФронтСистем", Истина);
	
	Попытка
		
		Объект.Записать();
		ОбъектЗаписан = Истина;
	    РегистрыСведений.ПЛ_СтатусыОбработкиЧековОбщепита.ПриЗаписиЧека(Объект, Ложь);
		
	Исключение
		
		СтрокаСообщенияОбОшибке = НСтр("ru = 'Не удалось записать %1.Описание ошибки: %2'");
		СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								Объект,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", СтрокаСообщенияОбОшибке, Истина);

		ОбъектЗаписан = Ложь;
		
	КонецПопытки;
	
	Возврат ОбъектЗаписан;
	
КонецФункции

Функция ПолучитьЧек(Запрос, КлючевыеПоля) Экспорт
	
	Результат = Неопределено;
	
	ПоляЗаполняемыеПриЗагрузкеСтрокой = "Ответственный,ПЛ_ДатаОткрытияЧека,ПЛ_КодСотрудника,Организация,КассаККМ,Подразделение,ДисконтнаяКарта,ПЛ_КодКарточки";
	ПоляЗаполняемыеПриЗагрузке = СтрРазделить(ПоляЗаполняемыеПриЗагрузкеСтрокой, ",");
	
	Для каждого Поле Из КлючевыеПоля Цикл
		Если Поле.Ключ = "Дата" Тогда
			Запрос.УстановитьПараметр("ДатаЗакрытияЧека", Поле.Значение);
		Иначе
			Запрос.УстановитьПараметр(Поле.Ключ, Поле.Значение);
		КонецЕсли;
		ИндексПоля = ПоляЗаполняемыеПриЗагрузке.Найти(Поле.Ключ);
		Если ИндексПоля <> Неопределено Тогда 
			ПоляЗаполняемыеПриЗагрузке.Удалить(ИндексПоля);
		КонецЕсли;	
	КонецЦикла; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Чек.ПолучитьОбъект();
		// Очистка полей шапки
		Для каждого ИмяПоля Из ПоляЗаполняемыеПриЗагрузке Цикл
			Результат[ИмяПоля] = Неопределено;
		КонецЦикла;
		
		Для каждого ТабличнаяЧасть Из Результат.Метаданные().ТабличныеЧасти Цикл
			Результат[ТабличнаяЧасть.Имя].Очистить();
		КонецЦикла;	
		
		Результат.ПометкаУдаления = Ложь;
		
	Иначе
		// Новый чек
		Результат = Документы.питДанныеПродажФронта.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(Результат, КлючевыеПоля);
		Результат.Заполнить(КлючевыеПоля);
		Если НЕ ЗначениеЗаполнено(Результат.Номер) Тогда
			Результат.УстановитьНовыйНомер();
		КонецЕсли;
	КонецЕсли;	
	
	Результат.ДополнительныеСвойства.Вставить("ПЛ_СброситьСтатусОбработки", Истина);
	
	Возврат Результат;
		
КонецФункции

Процедура ЗаписатьДанныеДляСопоставления(ТаблицаЗначенийORACLE, ПараметрыВыборки)
	
	ТипыОбъектов = ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем;
	
	КодыСопоставления = Новый ТаблицаЗначений;
	КолонкиКодыСопоставления = КодыСопоставления.Колонки;
	КолонкиКодыСопоставления.Добавить("ИмяПоляКод");
	КолонкиКодыСопоставления.Добавить("ТипОбъекта");
	КолонкиКодыСопоставления.Добавить("ИмяПоляНаименование");
	
	ДобавитьКодСопоставления(КодыСопоставления, "НомерТочкиПродаж", ТипыОбъектов.КассаККМ, "НаименованиеТочкиПродаж");
	ДобавитьКодСопоставления(КодыСопоставления, "КодТовара", ТипыОбъектов.Номенклатура, "НазваниеТовара");
	
	ТаблицаСопоставления = ТаблицаЗначенийORACLE.Скопировать(); 
	
	ТаблицаСопоставления.Свернуть("НомерТочкиПродаж, НаименованиеТочкиПродаж, КодТовара, НазваниеТовара");
	
	СоответствиеСФронтСистемами = РегистрыСведений.ПЛ_СоответствиеСФронтСистемами;
	
	Для Каждого СтрокаЗагрузки Из ТаблицаСопоставления Цикл
		Для Каждого СтрокаКодСопоставления Из КодыСопоставления Цикл
			
			КодСопоставления = СтрокаЗагрузки[СтрокаКодСопоставления.ИмяПоляКод];
			Если ПустаяСтрока(КодСопоставления) Тогда 
				// Не все поля с кодами обязательны
				Продолжить;	
			КонецЕсли;	
			
			текНаименование = "";
			Если Не ПустаяСтрока(СтрокаКодСопоставления.ИмяПоляНаименование) Тогда 
				// Наименование есть не всегда
				текНаименование = СтрокаЗагрузки[СтрокаКодСопоставления.ИмяПоляНаименование];
			КонецЕсли;
			
			Попытка
				СоответствиеСФронтСистемами.ДобавитьЗаписьДляСопоставления(СтрокаКодСопоставления.ТипОбъекта,
					ПараметрыВыборки.ФронтСистема, КодСопоставления, текНаименование);
			Исключение
				Отказ = Истина;
				СтрокаСообщенияОбОшибке = НСтр("ru = 'Не удалось записать данные для сопоставления для системы %1, тип объекта %2, код %3.
				|Описание ошибки: %4'");
				СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								ПараметрыВыборки.ФронтСистема,
								СтрокаКодСопоставления.ТипОбъекта,
								КодСопоставления,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", СтрокаСообщенияОбОшибке, Истина);
				
			КонецПопытки;
		КонецЦикла;	
	КонецЦикла;	
		
КонецПроцедуры

Процедура ЗаписатьВБазу(ТаблицаЗначенийORACLE, ПараметрыВыборки) Экспорт
	
	СоответсвиеТаблицыЧека = ПолучитьСоответсвиеРеквизитыЧека();
	// Отсортировать таблицу так, чтобы строки одного чека шли подряд
	ТаблицаЗначенийORACLE.Сортировать("БизнесДата, НОМЕРЧЕКА, НОМЕРТОЧКИПРОДАЖ, КОЛИЧЕСТВОТОВАРА Убыв");
		
	ТекущийЧек = Неопределено;
	
	// Ключевые поля идентифицируют документ чек
	КлючевыеПоляСтрокой = "Дата, НомерЧека, ПЛ_ФронтСистема, ПЛ_КодТочкиПродажи, ВидОперации";
	
	ЗапросПоиска = ЗапросПоискаЧека(КлючевыеПоляСтрокой);

	КлючевыеПоля = Новый Структура(КлючевыеПоляСтрокой);
	
	// Массив соответствий: [Имя в КлючевыеПоляСтрокой, Имя в ТаблицаЗначенийORACLE]
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("Дата","ДатаЗакрытияЧека");
	СоответствиеПолей.Вставить("НомерЧека","НОМЕРЧЕКА");
	СоответствиеПолей.Вставить("ПЛ_ФронтСистема","ФронтСистема");
	СоответствиеПолей.Вставить("ПЛ_КодТочкиПродажи","НОМЕРТОЧКИПРОДАЖ");
	
	// Разделяем строку КлючевыеПоляСтрокой на отдельные поля
	МассивКлючевыхПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючевыеПоляСтрокой,",");
	
	// Структура для хранения данных об оплате для текущего чека
	ДанныеОплаты = Новый Структура("МетодОплаты, СуммаОплаты", Неопределено, 0);
	
	Для каждого СтрокаТаблицы Из ТаблицаЗначенийORACLE Цикл
		
		Если СтрокаТаблицы.КОЛИЧЕСТВОТОВАРА = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Для Каждого Поле Из МассивКлючевыхПолей Цикл
			ИмяСтолбца = СоответствиеПолей[Поле]; // Получаем имя столбца из соответствия
			Если ИмяСтолбца <> Неопределено Тогда
				КлючевыеПоля.Вставить(Поле, СтрокаТаблицы[ИмяСтолбца]); // Заполняем структуру
			КонецЕсли;
		КонецЦикла;
	
		КлючевыеПоля.ВидОперации = Перечисления.питХозяйственныеОперации.ДанныеПродажФронтаПродажа;
		Если СтрокаТаблицы.КОЛИЧЕСТВОТОВАРА < 0 Тогда 
			КлючевыеПоля.ВидОперации = Перечисления.питХозяйственныеОперации.ДанныеПродажФронтаВозврат;
		КонецЕсли;
				
		// Сохранить текущий чек и начать новый
		Если ТекущийЧек <> Неопределено Тогда
			ПоляТекущегоЧека = Новый Структура(КлючевыеПоляСтрокой); 
			ЗаполнитьЗначенияСвойств(ПоляТекущегоЧека, ТекущийЧек);
			Если НЕ ОбщегоНазначения.ДанныеСовпадают(КлючевыеПоля, ПоляТекущегоЧека) Тогда 
				// Добавить строку оплаты перед сохранением чека
				ДобавитьСтрокуОплаты(ТекущийЧек, ДанныеОплаты);
				// Сохранить текущий чек
				ЗаписатьЧекВИБ(ТекущийЧек);
				ТекущийЧек = Неопределено;
				// Очистить данные оплаты для нового чека
				ДанныеОплаты = Новый Структура("МетодОплаты, СуммаОплаты", Неопределено, 0);
			КонецЕсли;
		КонецЕсли;
	
		// Поиск чека
		Если ТекущийЧек = Неопределено Тогда
			ТекущийЧек = ПолучитьЧек(ЗапросПоиска, КлючевыеПоля);
			ТекущийЧек.СуммаВключаетНДС = Истина;
			ТекущийЧек.MRS_Фискализирован = СтрокаТаблицы.Фискализирован;
			
			Для Каждого ЭлементСоответствия из СоответсвиеТаблицыЧека Цикл
				ИмяПоляЧека = ЭлементСоответствия.Ключ; 
				ИмяПоляТаблицы = ЭлементСоответствия.Значение;
				ТекущийЧек[ИмяПоляЧека] = СтрокаТаблицы[ИмяПоляТаблицы];
			КонецЦикла;
		КонецЕсли;
	                 	
		// Добавить строку в чек
		СтрокаТовары = ТекущийЧек.Товары.Добавить();
	
		СоответсвиеТоварыЧека = ПолучитьСоответсвиеРеквизитыТоварыЧека();
	
		Для Каждого ЭлементСоответствияТовары из СоответсвиеТоварыЧека Цикл
			ИмяПоляЧека = ЭлементСоответствияТовары.Ключ; 
			ИмяПоляТаблицы = ЭлементСоответствияТовары.Значение;
			СтрокаТовары[ИмяПоляЧека] = СтрокаТаблицы[ИмяПоляТаблицы];
		КонецЦикла;
	
		СтрокаТовары.КоличествоУпаковок = СтрокаТаблицы.КОЛИЧЕСТВОТОВАРА * ?(СтрокаТаблицы.КОЛИЧЕСТВОТОВАРА < 0, -1, 1);
		СтрокаТовары.Количество = СтрокаТовары.КоличествоУпаковок;
		СтрокаТовары.Коэффициент = 1;
	
		Если ТекущийЧек.ВидОперации = Перечисления.питХозяйственныеОперации.ДанныеПродажФронтаВозврат Тогда
			// Нужно инвертировать знак
			Если СтрокаТаблицы.СУММАСКИДКИ > 0 Тогда
				// Наценка
				СтрокаТовары.Сумма = - (СтрокаТаблицы.СУММАТОВАРА + СтрокаТаблицы.СУММАСКИДКИ);
				СтрокаТовары.СуммаСкидки = 0;
				СтрокаТовары.Цена = СтрокаТовары.Сумма;
			Иначе
				// Скидка или нет скидки
				СтрокаТовары.Сумма = - (СтрокаТаблицы.СУММАТОВАРА + СтрокаТаблицы.СУММАСКИДКИ);
				СтрокаТовары.СуммаСкидки = ?(СтрокаТаблицы.СУММАСКИДКИ < 0, -СтрокаТаблицы.СУММАСКИДКИ, 0);
			КонецЕсли;

			СтрокаТовары.СуммаНДС = - СтрокаТаблицы.ПРИЗНАКНАЛОГА;
		Иначе
			// Проверяем сумму скидки
			Если СтрокаТаблицы.СУММАСКИДКИ < 0 Тогда
				// Если скидка отрицательная - это наценка
				СтрокаТовары.Сумма = СтрокаТаблицы.СУММАТОВАРА;
				СтрокаТовары.СуммаСкидки = 0;
				СтрокаТовары.Цена = СтрокаТовары.Сумма
			Иначе
				// Если скидка положительная или нулевая
				СтрокаТовары.Сумма = СтрокаТаблицы.СУММАТОВАРА + ?(СтрокаТаблицы.СУММАСКИДКИ, СтрокаТаблицы.СУММАСКИДКИ, 0);
				СтрокаТовары.СуммаСкидки = СтрокаТаблицы.СУММАСКИДКИ;
			КонецЕсли;
		КонецЕсли;
	
		// Расчет ставки НДС
		СтрокаТовары.СтавкаНДС = СтавкаНДСПоСуммам(
			СтрокаТовары.Сумма, 
			СтрокаТовары.СуммаНДС
		);

		// Расчет процентов скидки
		СтрокаТовары.ПроцентСкидки = ?(СтрокаТовары.Сумма = 0, 0, 
			Окр(СтрокаТовары.СуммаСкидки * 100 / (СтрокаТовары.Сумма + СтрокаТовары.СуммаСкидки), 2));
			

		// Расчет процентов скидки строки
		СтрокаТовары.ПроцентСкидкиСтроки = ?(СтрокаТовары.Сумма = 0, 0, 
			Окр(СтрокаТовары.СуммаСкидкиСтроки * 100 / (СтрокаТовары.Сумма + СтрокаТовары.СуммаСкидки), 2));
	
		// Сохраняем метод оплаты (если указан) для текущего чека
		Если ЗначениеЗаполнено(СтрокаТаблицы.МетодОплаты) Тогда
			ДанныеОплаты.МетодОплаты = СтрокаТаблицы.МетодОплаты;
		КонецЕсли;
	
	КонецЦикла;	
		
	// Записать последний чек, если он есть
	Если ТекущийЧек <> Неопределено Тогда
		// Добавить строку оплаты перед сохранением чека
		ДобавитьСтрокуОплаты(ТекущийЧек, ДанныеОплаты);
		// Сохранить текущий чек
		ЗаписатьЧекВИБ(ТекущийЧек);
	КонецЕсли;	
	
КонецПроцедуры

// Погрешность в определении ставки должна быть не более 2-х рублей.
// Если получается больше, то ставку не заполняем, чек не считается обработанным.
// Сделаем в чеке ставку НДС обязательным реквизитом, с пустой ставкой и выпуск блюд не формируется
Функция СтавкаНДСПоСуммам(СуммаСНДС, СуммаНДС) 
		
	Запрос = новый запрос;
	Запрос.текст = 
	"ВЫБРАТЬ
	|	СтавкиНДС.Ссылка КАК Ссылка,
	|	СтавкиНДС.ПеречислениеСтавкаНДС КАК ПеречислениеСтавкаНДС
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтавкиНДС.Ссылка,
	|	СтавкиНДС.ПеречислениеСтавкаНДС
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтавкиНДС.Ссылка,
	|	СтавкиНДС.ПеречислениеСтавкаНДС
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтавкиНДС.Ссылка,
	|	СтавкиНДС.ПеречислениеСтавкаНДС
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтавкиНДС.Ссылка,
	|	СтавкиНДС.ПеречислениеСтавкаНДС
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Год2026 = Год(ТекущаяДата());
	
	Если Год2026 = 2026 Тогда
		БлижайшаяСтавка = Перечисления.СтавкиНДС.НДС22;
	Иначе
		БлижайшаяСтавка = Перечисления.СтавкиНДС.НДС20;
	КонецЕсли;
	
	// Если НДС = 0 → Ставка "Без НДС"
	Если СуммаНДС = 0 ИЛИ СуммаСНДС = 0 ИЛИ СуммаНДС = СуммаСНДС Тогда
	    Возврат РезультатЗапроса.Найти(Перечисления.СтавкиНДС.БезНДС, "ПеречислениеСтавкаНДС").Ссылка;
	КонецЕсли;

	// формула расчета ставки НДС
	СуммаБезНДС = СуммаСНДС - СуммаНДС;
	РасчетнаяСтавка = (СуммаНДС / СуммаБезНДС) * 100;

	// Допуск для определения ставки (±1.5%)
	Допуск = 1.5;

	// Определяем ближайшую ставку с учетом допуска
	Если Окр(Макс(РасчетнаяСтавка - 10, -(РасчетнаяСтавка - 10)), 2) <= Допуск Тогда
	    Результат = РезультатЗапроса.Найти(Перечисления.СтавкиНДС.НДС10, "ПеречислениеСтавкаНДС").Ссылка;
	ИначеЕсли Окр(Макс(РасчетнаяСтавка - 18, -(РасчетнаяСтавка - 18)), 2) <= Допуск Тогда
	    Результат = РезультатЗапроса.Найти(Перечисления.СтавкиНДС.НДС18, "ПеречислениеСтавкаНДС").Ссылка;
	ИначеЕсли Окр(Макс(РасчетнаяСтавка - 20, -(РасчетнаяСтавка - 20)), 2) <= Допуск Тогда
	    Результат = РезультатЗапроса.Найти(Перечисления.СтавкиНДС.НДС20, "ПеречислениеСтавкаНДС").Ссылка;
	ИначеЕсли Год2026 = 2026 И Окр(Макс(РасчетнаяСтавка - 22, -(РасчетнаяСтавка - 22)), 2) <= Допуск Тогда
	    Результат = РезультатЗапроса.Найти(Перечисления.СтавкиНДС.НДС22, "ПеречислениеСтавкаНДС").Ссылка;
	Иначе
	    // Если не попали в диапазоны, выбираем ближайшую ставку
	    МинимальноеОтклонение = 100;
	    
	    // Создаем массив ставок
	    МассивСтавок = Новый Массив;
	    МассивСтавок.Добавить(Новый Структура("Значение, Ставка", 10, Перечисления.СтавкиНДС.НДС10));
	    МассивСтавок.Добавить(Новый Структура("Значение, Ставка", 18, Перечисления.СтавкиНДС.НДС18));
		МассивСтавок.Добавить(Новый Структура("Значение, Ставка", 20, Перечисления.СтавкиНДС.НДС20));
		
		Если Год2026 = 2026 Тогда
			МассивСтавок.Добавить(Новый Структура("Значение, Ставка", 22, Перечисления.СтавкиНДС.НДС22));
		КонецЕсли;
		
	    Для Каждого ЗначениеСтавки Из МассивСтавок Цикл
	        Отклонение = Макс(РасчетнаяСтавка - ЗначениеСтавки.Значение, -(РасчетнаяСтавка - ЗначениеСтавки.Значение));
	        Если Отклонение < МинимальноеОтклонение Тогда
	            МинимальноеОтклонение = Отклонение;
	            БлижайшаяСтавка = ЗначениеСтавки.Ставка;
	        КонецЕсли;
	    КонецЦикла;
	    
	    Результат = РезультатЗапроса.Найти(БлижайшаяСтавка, "ПеречислениеСтавкаНДС").Ссылка;
	КонецЕсли;

	Возврат Результат;
			
КонецФункции

// Новая процедура для добавления строки оплаты
Процедура ДобавитьСтрокуОплаты(Чек, ДанныеОплаты)
	
	РассчетнаяСумма = РасчетСуммыДокумента(Чек);
	
	СтрокаОплаты = Чек.Оплаты.Добавить();
	СтрокаОплаты.СуммаОплаты = РассчетнаяСумма;
	СтрокаОплаты.ВидОплаты = ?(ЗначениеЗаполнено(ДанныеОплаты.МетодОплаты), ДанныеОплаты.МетодОплаты, ВидОплатыНаличными());
	
КонецПроцедуры

Функция РасчетСуммыДокумента(Чек) 
	
	СуммаСкидкиДокумента = Чек.Товары.Итог("СуммаСкидки") + Чек.Товары.Итог("СуммаСкидкиСтроки");
	
	СуммаДокумента = питОбщегоНазначения.ПолучитьСуммуДокументаСНДС(Чек, "Товары")
		+ питОбщегоНазначения.ПолучитьСуммуДокументаСНДС(Чек, "Модификаторы") - СуммаСкидкиДокумента;
		
	Возврат СуммаДокумента;
	
КонецФункции
	
Функция ПолучениеДанныхORACLE(ПараметрыВыборки)
	
	Попытка
		
		Соединение = Новый COMОбъект("ADODB.Connection");
		
		СтруктураПараметров = ПолучитьПараметрыПодключения(ПараметрыВыборки.ФронтСистема);
	    
	    СтрокаПодключения = "Provider=OraOLEDB.Oracle;Data Source=(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=" + СтруктураПараметров.Сервер + ")(PORT=" + СтруктураПараметров.Порт + "))(CONNECT_DATA=(SID=" + СтруктураПараметров.SID + ")));User Id=" + СтруктураПараметров.Пользователь + ";Password=" + СтруктураПараметров.Пароль + ";";

	    Соединение.Open(СтрокаПодключения);

	Исключение

		СтрокаСообщенияОбОшибке = НСтр("ru = 'Ошибка подключения к базе данных TNG: 
				|Описание ошибки: %1'");
		СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", СтрокаСообщенияОбОшибке, Истина);
 
	КонецПопытки;

	//выборка через RecordSet
	RecordSet  = Новый COMОбъект("ADODB.RecordSet");
	RecordSet.ActiveConnection = Соединение;
	RecordSet.CursorType = 3;
	RecordSet.LockType = 2; 
	
	//ДатаЗапретаПодключенияНачало = Формат(НачалоДня(СтруктураПараметров.ДатаЗапретаПодключения), "ДФ='yyyy-MM-dd HH:mm:ss'");   
	//ДатаЗапретаПодключенияКонец = Формат(КонецДня(СтруктураПараметров.ДатаЗапретаПодключения), "ДФ='yyyy-MM-dd HH:mm:ss'"); 
	
	#Область Запрос
	
	УсловиеДатаЗагрузки = "AND d.tm BETWEEN TO_TIMESTAMP('" + ПараметрыВыборки.НачалоВыборки + "','YYYY-MM-DD HH24:MI:SS') AND TO_TIMESTAMP('" + ПараметрыВыборки.КонецВыборки + "','YYYY-MM-DD HH24:MI:SS')";
	
	УсловиеТочкиПродажСуммовыеЧеки = ?(ПараметрыВыборки.СтрокаВыборкиТочекПродаж = "", "", "AND d.rvc IN (SELECT rvc_id FROM club.rvc WHERE pos_rvc in (" + ПараметрыВыборки.СтрокаВыборкиТочекПродаж + "))"); 
	
	УсловиеТочкиПродаж =  ?(ПараметрыВыборки.СтрокаВыборкиТочекПродаж = "", "", "AND r.pos_rvc in (" + ПараметрыВыборки.СтрокаВыборкиТочекПродаж + ")");
	
	УсловиеНомерЧека = ?(ПараметрыВыборки.НомерЧека <> 0, "AND d.CHKNUM = " + Формат(ПараметрыВыборки.НомерЧека, "ЧГ="), "");

	CommandText = "WITH CheckCounts AS (
				|    SELECT 
				|        d.doc_id,
				|        SUM(CASE WHEN dd.count > 0 THEN 1 ELSE 0 END) AS positive_items
				|    FROM club.docs_dtl dd
				|    JOIN club.docs d ON d.doc_id = dd.doc_id
				|    WHERE d.cofirmation = 'T'
				|        " + УсловиеДатаЗагрузки + "
				|        " + УсловиеТочкиПродажСуммовыеЧеки + "
				|        " + УсловиеНомерЧека + "
				|    GROUP BY d.doc_id
				|),
				|MaxPaymentMethod AS (
				|    SELECT 
				|        doc_id,
				|        tm_id,
				|        tm_name,
				|        ROW_NUMBER() OVER (PARTITION BY doc_id ORDER BY tm_id DESC) AS rn
				|    FROM club.docs_paym
				|)
				|SELECT
				|    TO_CHAR(r.pos_rvc) AS НомерТочкиПродаж,
				|    r.name AS НаименованиеТочкиПродаж,
				|    TO_NUMBER(d.chknum) AS НомерЧека,
				|    TO_CHAR(d.TM_OPEN, 'DD-MM-YYYY HH24:MI:SS') AS ДатаОткрытияЧекаСтрока,
				|    TO_CHAR(d.TM, 'DD-MM-YYYY HH24:MI:SS') AS ДатаЗакрытияЧекаСтрока,
				|    TO_CHAR(d.bussines_date, 'DD-MM-YYYY HH24:MI:SS') AS БизнесДатаСтрока,
				|    dd.mi_id AS КодТовара,
				|    m.name1 AS НазваниеТовара,
				|    SUM(dd.count) AS КоличествоТовара,
				|    CASE
				|        WHEN SUM(dd.count) = 0 THEN 0
				|        ELSE SUM(dd.ttl - dd.pay_ttl_subscr) / SUM(dd.count)
				|    END AS ЦенаТовара,
				|    SUM(dd.ttl - dd.dsc - dd.pay_ttl_subscr) AS СуммаТовара,
				|    d.TTL AS СуммаЧека,
				|    SUM(dd.dsc) AS СуммаСкидки,
				|    d.operator AS ИмяСотрудника,
				|    CASE
				|        WHEN d.FT_STATUS IS NULL THEN 0
				|        ELSE 1
				|    END AS Фискализирован,
				|    TRUNC(SUM(dd.tax_addon), 2) AS ПризнакНалога,
				|    dp.tm_id AS НомерМетодаОплаты,
				|    TO_CHAR(dp.tm_name) AS НаименованиеМетодаОплаты
				|FROM club.docs_dtl dd
				|JOIN club.docs d ON d.doc_id = dd.doc_id
				|JOIN club.menu_items m ON m.code = dd.mi_id
				|JOIN club.menu_fgrp mfg ON mfg.fgrp_id = m.fgrp
				|JOIN club.menu_si msi ON msi.si_id = m.si
				|JOIN club.rvc r ON r.rvc_id = d.rvc
				|JOIN CheckCounts cc ON cc.doc_id = d.doc_id
				|LEFT JOIN MaxPaymentMethod dp ON dp.doc_id = d.doc_id AND dp.rn = 1
				|WHERE d.cofirmation = 'T'
				|        " + УсловиеДатаЗагрузки + "
				|        " + УсловиеТочкиПродажСуммовыеЧеки + "
				|        " + УсловиеНомерЧека + "
				|    AND dd.VOID_FLAG IS NULL
				|    AND (
				|        dd.count <> 0
				|        OR (dd.count < 0 AND cc.positive_items = 0)
				|    )
				|GROUP BY
				|    r.pos_rvc,
				|    r.name,
				|    d.chknum,
				|    d.TM_OPEN,
				|    d.TM,
				|    d.bussines_date,
				|    dd.mi_id,
				|    m.name1,
				|    d.TTL,
				|    d.operator,
				|    dd.VOID_FLAG,
				|    d.FT_STATUS,
				|    dp.tm_id,
				|    dp.tm_name
				|HAVING SUM(dd.count) <> 0
				|ORDER BY d.chknum, dd.mi_id
				|";	
#КонецОбласти
	
	Попытка
		
		RecordSet.Open(CommandText, Соединение); 
		
	Исключение
		
        Соединение.Close();
		
		СтрокаСообщенияОбОшибке = НСтр("ru = 'Ошибка выборки RECORDSET в данных TNG: 
				|Описание ошибки: %1'");
		СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", СтрокаСообщенияОбОшибке, Истина);
		
	КонецПопытки;		
	
	Если RecordSet.EOF() = Истина Тогда
		
		RecordSet.Close();
		
		Соединение.Close();

		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", "Данных нет. Не обязательно ошибка. Проверить наличие чеков.");
		
		ВызватьИсключение "Данных нет. Не обязательно ошибка. Проверить наличие чеков.";
		
	КонецЕсли;

	// Создаем новую пустую таблицу значений
	ТаблицаЗначенийORACLE = Новый ТаблицаЗначений;

	// Добавляем колонки в таблицу значений
	Для Каждого Колонка Из RecordSet.Fields Цикл
	    ИмяКолонки = Колонка.Name;
	    ТипДанных = ТипЗнч(Колонка.Value);
	    
	    // Определяем тип данных для колонок таблицы значений
	    Если ТипДанных = Тип("Число") Тогда
	        ТипКолонки = Новый ОписаниеТипов("Число");
	    ИначеЕсли ТипДанных = Тип("Дата") Тогда
	        ТипКолонки = Новый ОписаниеТипов("Дата");
	    ИначеЕсли ТипДанных = Тип("Строка") Тогда
	        ТипКолонки = Новый ОписаниеТипов("Строка");
		ИначеЕсли ИмяКолонки = "НАИМЕНОВАНИЕСКИДКИЧЕКА" Тогда //может быть null
			ТипКолонки = Новый ОписаниеТипов("Строка");
		КонецЕсли;
		
	    ТаблицаЗначенийORACLE.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	  
	КонецЦикла;
	
	ТаблицаЗначенийORACLE.Колонки.Добавить("БизнесДата", Новый ОписаниеТипов("Дата"));
	ТаблицаЗначенийORACLE.Колонки.Добавить("ДатаОткрытияЧека", Новый ОписаниеТипов("Дата"));
	ТаблицаЗначенийORACLE.Колонки.Добавить("ДатаЗакрытияЧека", Новый ОписаниеТипов("Дата"));
	
	// Заполняем строки таблицы значений данными из RecordSet
	Пока RecordSet.EOF() = Ложь Цикл
		
		НоваяСтрока = ТаблицаЗначенийORACLE.Добавить();

	Для Каждого Колонка Из RecordSet.Fields Цикл
		
		ИмяКолонки = Колонка.Name;
	    ЗначениеКолонки = Колонка.Value;
	    
	    // Устанавливаем значение в соответствующую колонку новой строки
	    НоваяСтрока[ИмяКолонки] = ЗначениеКолонки;
		
	КонецЦикла;

		RecordSet.MoveNext(); // Переходим к следующей записи в RecordSet
		
	КонецЦикла;
	
	Попытка
		
		RecordSet.Close();

    	Соединение.Close(); 
		
	Исключение
	//соединение может быть уже закрыто	
	КонецПопытки;
	
	Для Каждого Строка из ТаблицаЗначенийORACLE Цикл
		
		БизнесДата = Строка.БИЗНЕСДАТАСТРОКА;		
		Строка.БизнесДата = СтроковыеФункцииКлиентСервер.СтрокаВДату(БизнесДата);
		
		ДатаОткрытияЧека = Строка.ДАТАОТКРЫТИЯЧЕКАСТРОКА;		
		Строка.ДатаОткрытияЧека = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаОткрытияЧека, ЧастиДаты.ДатаВремя);
		
		ДатаЗакрытияЧека = Строка.ДАТАЗАКРЫТИЯЧЕКАСТРОКА;		
		Строка.ДатаЗакрытияЧека = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаЗакрытияЧека, ЧастиДаты.ДатаВремя);
		
	КонецЦикла;
	
	//удалить колонки
	Колонка = ТаблицаЗначенийORACLE.Колонки.Найти("БИЗНЕСДАТАСТРОКА"); 
	Если НЕ Колонка = Неопределено Тогда
		ТаблицаЗначенийORACLE.Колонки.Удалить(Колонка);
	КонецЕсли;
	
	Колонка = ТаблицаЗначенийORACLE.Колонки.Найти("ДАТАОТКРЫТИЯЧЕКАСТРОКА"); 
	Если НЕ Колонка = Неопределено Тогда
		ТаблицаЗначенийORACLE.Колонки.Удалить(Колонка);
	КонецЕсли;
	
	Колонка = ТаблицаЗначенийORACLE.Колонки.Найти("ДАТАЗАКРЫТИЯЧЕКАСТРОКА"); 
	Если НЕ Колонка = Неопределено Тогда
		ТаблицаЗначенийORACLE.Колонки.Удалить(Колонка);
	КонецЕсли;
	
	// Отсортировать таблицу так, чтобы строки одного чека шли подряд
	ТаблицаЗначенийORACLE.Сортировать("БизнесДата, НОМЕРЧЕКА, НОМЕРТОЧКИПРОДАЖ, КОЛИЧЕСТВОТОВАРА Убыв");
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаORACLE.БизнесДата КАК БизнесДата,
	               |	ТаблицаORACLE.ДатаЗакрытияЧека КАК ДатаЗакрытияЧека,
	               |	ТаблицаORACLE.ДатаОткрытияЧека КАК ДатаОткрытияЧека,
	               |	ТаблицаORACLE.ИМЯСОТРУДНИКА КАК ИМЯСОТРУДНИКА,
	               |	ТаблицаORACLE.КОДТОВАРА КАК КОДТОВАРА,
	               |	ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА КАК КОЛИЧЕСТВОТОВАРА,
	               |	ТаблицаORACLE.НАЗВАНИЕТОВАРА КАК НАЗВАНИЕТОВАРА,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕТОЧКИПРОДАЖ КАК НАИМЕНОВАНИЕТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ КАК НОМЕРТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРЧЕКА КАК НОМЕРЧЕКА,
	               |	ТаблицаORACLE.ПРИЗНАКНАЛОГА КАК ПРИЗНАКНАЛОГА,
	               |	ТаблицаORACLE.СУММАСКИДКИ КАК СУММАСКИДКИ,
	               |	ТаблицаORACLE.СУММАТОВАРА КАК СУММАТОВАРА,
	               |	ТаблицаORACLE.СУММАЧЕКА КАК СУММАЧЕКА,
	               |	ТаблицаORACLE.ЦЕНАТОВАРА КАК ЦЕНАТОВАРА,
	               |	ТаблицаORACLE.ФИСКАЛИЗИРОВАН КАК ФИСКАЛИЗИРОВАН,
	               |	ТаблицаORACLE.НомерМетодаОплаты КАК НомерМетодаОплаты,
	               |	ТаблицаORACLE.НаименованиеМетодаОплаты КАК НаименованиеМетодаОплаты
	               |ПОМЕСТИТЬ ТаблицаORACLE
	               |ИЗ
	               |	&ТаблицаORACLE КАК ТаблицаORACLE
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Кассы.ФронтСистема КАК ФронтСистема,
	               |	ЕСТЬNULL(Кассы.Объект, ЗНАЧЕНИЕ(Справочник.КассыККМ.ПустаяСсылка)) КАК КассаККМ,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕТОЧКИПРОДАЖ КАК НАИМЕНОВАНИЕТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ КАК НОМЕРТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРЧЕКА КАК НОМЕРЧЕКА,
	               |	ТаблицаORACLE.БизнесДата КАК БизнесДата,
	               |	ТаблицаORACLE.ДатаЗакрытияЧека КАК ДатаЗакрытияЧека,
	               |	ТаблицаORACLE.ДатаОткрытияЧека КАК ДатаОткрытияЧека,
	               |	ТаблицаORACLE.КОДТОВАРА КАК КОДТОВАРА,
	               |	ТаблицаORACLE.НАЗВАНИЕТОВАРА КАК НАЗВАНИЕТОВАРА,
	               |	ЕСТЬNULL(Номенклатура.Объект, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА Номенклатура.Объект ЕСТЬ NULL
	               |			ТОГДА ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА Номенклатура.Количество * ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА = 0
	               |					ТОГДА ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА
	               |				ИНАЧЕ Номенклатура.Количество * ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА
	               |			КОНЕЦ
	               |	КОНЕЦ КАК КОЛИЧЕСТВОТОВАРА,
	               |	ТаблицаORACLE.ЦЕНАТОВАРА КАК ЦЕНАТОВАРА,
	               |	ТаблицаORACLE.СУММАТОВАРА КАК СУММАТОВАРА,
	               |	ТаблицаORACLE.ПРИЗНАКНАЛОГА КАК ПРИЗНАКНАЛОГА,
	               |	ТаблицаORACLE.СУММАСКИДКИ КАК СУММАСКИДКИ,
	               |	ТаблицаORACLE.СУММАЧЕКА КАК СУММАЧЕКА,
	               |	ТаблицаORACLE.ИМЯСОТРУДНИКА КАК ИМЯСОТРУДНИКА,
	               |	ТаблицаORACLE.ФИСКАЛИЗИРОВАН КАК ФИСКАЛИЗИРОВАН,
	               |	ЕСТЬNULL(Кассы.Объект.Владелец, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	               |	ЕСТЬNULL(Кассы.Объект.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	               |	ЕСТЬNULL(Кассы.Объект.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Подразделение,
	               |	ЕСТЬNULL(Кассы.Объект.питКассовыйУзел, ЗНАЧЕНИЕ(ПланОбмена.питУдаленныеКассы.ПустаяСсылка)) КАК КассовыйУзел,
	               |	ТаблицаORACLE.НомерМетодаОплаты КАК НомерМетодаОплаты,
	               |	ТаблицаORACLE.НаименованиеМетодаОплаты КАК НаименованиеМетодаОплаты,
	               |	питВидыОплатОрганизаций.Ссылка КАК МетодОплаты
	               |ИЗ
	               |	ТаблицаORACLE КАК ТаблицаORACLE
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК Кассы
	               |		ПО (ПОДСТРОКА(ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ, 1, 20) = ПОДСТРОКА(Кассы.Код, 1, 20))
	               |			И (Кассы.ФронтСистема = &ФронтСистема)
	               |			И (Кассы.ТипОбъекта = &ТипОбъектаКасса)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК Номенклатура
	               |		ПО (ПОДСТРОКА(ТаблицаORACLE.КОДТОВАРА, 1, 20) = ПОДСТРОКА(Номенклатура.Код, 1, 20))
	               |			И (Номенклатура.ФронтСистема = &ФронтСистема)
	               |			И (Номенклатура.ТипОбъекта = &ТипОбъектаНоменклатура)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.MRS_МетодыОплатФронтСистем КАК MRS_МетодыОплатФронтСистем
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.питВидыОплатОрганизаций КАК питВидыОплатОрганизаций
	               |			ПО MRS_МетодыОплатФронтСистем.ТипОплаты = питВидыОплатОрганизаций.ТипОплаты
	               |		ПО ТаблицаORACLE.НомерМетодаОплаты = MRS_МетодыОплатФронтСистем.НомерМетодаОплаты
	               |			И (MRS_МетодыОплатФронтСистем.ФронтСистема = &ФронтСистема)";
	
	ТипОбъектаКасса = ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.КассаККМ; 
	ТипОбъектаНоменклатура = ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Номенклатура; 
	Запрос.УстановитьПараметр("ТипОбъектаКасса", ТипОбъектаКасса);
	Запрос.УстановитьПараметр("ТипОбъектаНоменклатура", ТипОбъектаНоменклатура);
	Запрос.УстановитьПараметр("ФронтСистема", ПараметрыВыборки.ФронтСистема);
	Запрос.УстановитьПараметр("ТаблицаORACLE", ТаблицаЗначенийORACLE);
	
	ТаблицаЗначенийORACLE = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗначенийORACLE;
	
КонецФункции

//получение других данных из tng
Процедура ПолучениеВспомогательныхДанныхORACLE(ФронтСистема) Экспорт
	
	Попытка
		
		Соединение = Новый COMОбъект("ADODB.Connection");
		
		СтруктураПараметров = ПолучитьПараметрыПодключения(ФронтСистема);
	    
	    СтрокаПодключения = "Provider=OraOLEDB.Oracle;Data Source=(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=" + СтруктураПараметров.Сервер + ")(PORT=" + СтруктураПараметров.Порт + "))(CONNECT_DATA=(SID=" + СтруктураПараметров.SID + ")));User Id=" + СтруктураПараметров.Пользователь + ";Password=" + СтруктураПараметров.Пароль + ";";

	    Соединение.Open(СтрокаПодключения);

	Исключение
		СтрокаСообщенияОбОшибке = НСтр("ru = 'Ошибка подключения к базе данных TNG: 
				|Описание ошибки: %1'");
		СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
		ЗаписьЖурналаРегистрацииОбмена("Загрузка вспомогательных данных TNG", СтрокаСообщенияОбОшибке, Истина);

	КонецПопытки;

	//выборка через RecordSet
	RecordSet  = Новый COMОбъект("ADODB.RecordSet");
	RecordSet.ActiveConnection = Соединение;
	RecordSet.CursorType = 3;
	RecordSet.LockType = 2; 
		
	CommandText = "SELECT 
    			|	ID AS НомерМетодаОплаты,
    			|	NAME AS НаименованиеТипаОплаты,
    			|	DECODE(FISCAL, 'T', 1, 0) AS Фискальный
				|FROM CLUB.TENDERMEDIA";	
	Попытка
		
		RecordSet.Open(CommandText, Соединение); 
		
	Исключение
		
        Соединение.Close();
		
		СтрокаСообщенияОбОшибке = НСтр("ru = 'Ошибка выборки RECORDSET в данных TNG: 
				|Описание ошибки: %1'");
		СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
		ЗаписьЖурналаРегистрацииОбмена("Загрузка вспомогательных данных TNG", СтрокаСообщенияОбОшибке, Истина);

	КонецПопытки;		
	
	Если RecordSet.EOF() = Истина Тогда
		
		RecordSet.Close();
		
		Соединение.Close();
		
		ЗаписьЖурналаРегистрацииОбмена("Загрузка вспомогательных данных TNG", "Данных нет.", Истина);
		
		ВызватьИсключение "Загрузка вспомогательных данных TNG. Данных нет.";
		
	КонецЕсли;
	
	// Создаем новую пустую таблицу значений
	ТаблицаЗначенийORACLE = Новый ТаблицаЗначений;

	 //Добавляем колонки в таблицу значений
	Для Каждого Колонка Из RecordSet.Fields Цикл
	    ИмяКолонки = Колонка.Name;
	    ТипДанных = ТипЗнч(Колонка.Value);
		
	    // Определяем тип данных для колонок таблицы значений
		Если ИмяКолонки = "НомерМетодаОплаты" Тогда //может быть null
			ТипКолонки = Новый ОписаниеТипов("Число");
		ИначеЕсли ИмяКолонки = "НомерТипаОплаты" Тогда
			ТипКолонки = Новый ОписаниеТипов("Число");
		ИначеЕсли ИмяКолонки = "НаименованиеТипаОплаты" Тогда
			ТипКолонки = Новый ОписаниеТипов("Строка");
		ИначеЕсли ТипДанных = Тип("Число") Тогда
	        ТипКолонки = Новый ОписаниеТипов("Число");
	    ИначеЕсли ТипДанных = Тип("Дата") Тогда
	        ТипКолонки = Новый ОписаниеТипов("Дата");
	    ИначеЕсли ТипДанных = Тип("Строка") Тогда
	        ТипКолонки = Новый ОписаниеТипов("Строка");
		КонецЕсли;
	
	    ТаблицаЗначенийORACLE.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	  
	КонецЦикла;
	
		
	// Заполняем строки таблицы значений данными из RecordSet
	Пока RecordSet.EOF() = Ложь Цикл
		
		НоваяСтрока = ТаблицаЗначенийORACLE.Добавить();

	Для Каждого Колонка Из RecordSet.Fields Цикл
		
		ИмяКолонки = Колонка.Name;
	    ЗначениеКолонки = Колонка.Value;
	    
	    // Устанавливаем значение в соответствующую колонку новой строки
	    НоваяСтрока[ИмяКолонки] = ЗначениеКолонки;
		
	КонецЦикла;

		RecordSet.MoveNext(); // Переходим к следующей записи в RecordSet
		
	КонецЦикла;
	
	Попытка
		
		RecordSet.Close();

    	Соединение.Close(); 
		
	Исключение
	//соединение может быть уже закрыто	
	КонецПопытки;
	
	ЗаписатьМетодыОплат(ФронтСистема, ТаблицаЗначенийORACLE);
		
КонецПроцедуры

Процедура ЗаписатьМетодыОплат(ФронтСистема, ТаблицаЗначенийORACLE)
	
	Попытка
		
		Для Каждого Строка из ТаблицаЗначенийORACLE Цикл
			
			ТипОплаты = Неопределено;
			
			Если Строка.НомерМетодаОплаты = 1 Тогда
				ТипОплаты = Перечисления.питТипыОплат.Наличные;
			Иначе
				ТипОплаты = Перечисления.питТипыОплат.ПлатежнаяКарта;
			КонецЕсли;
			
			 // Проверяем наличие записи в регистре
		    НаборЗаписей = РегистрыСведений.MRS_МетодыОплатФронтСистем.СоздатьНаборЗаписей();
		    НаборЗаписей.Отбор.ФронтСистема.Установить(ФронтСистема);
		    НаборЗаписей.Отбор.НомерМетодаОплаты.Установить(Строка.НомерМетодаОплаты);
		    НаборЗаписей.Прочитать();
		    
		    // Если запись существует, пропускаем
		    Если НаборЗаписей.Количество() > 0 Тогда
		        Продолжить; 
		    КонецЕсли;
		    
		    // Создаём новую запись, если не найдена существующая
		    НоваяЗапись = НаборЗаписей.Добавить();
		    НоваяЗапись.ФронтСистема = ФронтСистема; 
		    НоваяЗапись.НомерМетодаОплаты = Строка.НомерМетодаОплаты;
		    НоваяЗапись.НаименованиеТипаОплаты = Строка.НаименованиеТипаОплаты;    
		    НоваяЗапись.ТипОплаты = ТипОплаты;
			НоваяЗапись.Фискальный				= ?(Строка.Фискальный = 1, Истина, Ложь);

			НаборЗаписей.Записать(Истина);

		КонецЦикла;
			
	Исключение
			
		СтрокаСообщенияОбОшибке = НСтр("ru = 'Загрузка вспомогательных данных TNG. Ошибка записи в регистр типов оплат: 
				|Описание ошибки: %1'");
		СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
		ЗаписьЖурналаРегистрацииОбмена("Загрузка вспомогательных данных TNG.", СтрокаСообщенияОбОшибке, Истина);	
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура СдвинутьДатуЗапрета(ПараметрыВыборки)
	
	Попытка
		
		Набор = РегистрыСведений.MRS_НастройкиПодключенияКФронтСистемам.СоздатьНаборЗаписей();
		Набор.Отбор.ФронтСистема.Установить(ПараметрыВыборки.ФронтСистема);
		Набор.Прочитать();
		
		Для Каждого Запись из Набор Цикл
			
			Запись.ДатаЗапретаПодключения = ТекущаяДата();
			
		КонецЦикла;
		
		Набор.Записать();                                                                                                 
			
	Исключение
			
		СтрокаСообщенияОбОшибке = НСтр("ru = 'Не удалось сдвинуть дату запрета подключения к TNG: 
				|Описание ошибки: %1'");
		СтрокаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщенияОбОшибке,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
		ЗаписьЖурналаРегистрацииОбмена("Загрузка чеков TNG", СтрокаСообщенияОбОшибке, Истина);	
		
	КонецПопытки;
		
КонецПроцедуры

Процедура ЗаписьЖурналаРегистрацииОбмена(Событие, Комментарий, ЭтоОшибка = Ложь) Экспорт
	
	Уровень = ?(ЭтоОшибка, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	
	ЗаписьЖурналаРегистрации(Событие, Уровень,,, Комментарий);

КонецПроцедуры

#КонецОбласти
